app/views/users/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 2]]
---
  <ul>
    <% @user.tasks.each do |task| %>