app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "imageable_type", "imageable_id", "created_at", "updated_at", "owner_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "hello det"], ["imageable_type", "Task"], ["imageable_id", 3], ["created_at", "2020-05-22 01:35:57.550475"], ["updated_at", "2020-05-22 01:35:57.550475"], ["owner_id", 4]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.user_id = current_user.id

    # render json: @comment

    if @comment.save