app/controllers/tasks_controller.rb

INSERT INTO "users" ("username", "session_token", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
INSERT INTO "tasks" ("user_id", "title", "description", "private", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 2], ["title", "Make Bread"], ["description", "knead and bake"], ["private", true], ["created_at", "2020-05-19 22:21:57.186414"], ["updated_at", "2020-05-19 22:21:57.186414"]]
---
  def create
    @task = current_user.tasks.new(task_params)

    if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "tasks" SET "completed" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completed", true], ["updated_at", "2020-05-19 22:22:04.475563"], ["id", 4]]
---
  def update
    @task = Task.find(params[:id])
    if @task.update_attributes(task_params)