app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Willy"], ["LIMIT", 1]]
INSERT INTO "users" ("username", "session_token", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @user = User.new(user_params)

    if !User.pass_valid?(params[:user][:password])
      flash[:errors] = ["Password must be at least 6 characters long"]
      render :new
    elsif User.find_by(username: params[:user][:username])
      flash[:errors] = ["Sorry, that username is taken, please try another"]
      render :new
    elsif @user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1  [["user_id", 4]]
---
  def show
    @user = User.includes(:tasks).find(params[:id])