app/models/task.rb

SELECT "tasks".* FROM "tasks"
---
  def self.find_public_by_user_id(id)
    @tasks = Task.select { |task| task.user_id == id && !task.private }

SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" IN ($1, $2)  [["id", nil], ["id", nil]]
---
  def self.all_public_tasks
    @tasks = Task.order(created_at: :desc).includes(:owner)